sedfoam-master/tutorials/laminar/2DCollapse/loose/initial_1D_profile/1DSedim/constant/twophaseRASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      twophaseRASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// * * * * * * * * definition of turbulence coefficient and others * * * * * * * * * //
SUS             SUS [ 0 0 0 0 0 0 0 ] 0.;  //set to 1 to include turbulent suspension term, else set to 0
C3ep           C3ep [ 0 0 0 0 0 0 0 ] 0.2; //set the coefficient of C3 in epsilon equation */
C4ep           C4ep [ 0 0 0 0 0 0 0 ] 0;
KE1             KE1 [ 0 0 0 0 0 0 0 ] 0;  //density stra (Uf-Us)
KE2             KE2 [ 0 0 0 0 0 0 0 ] 1;  //turb modulation
KE3             KE3 [ 0 0 0 0 0 0 0 ] 0;  //turb generation
KE4             KE4 [ 0 0 0 0 0 0 0 ] 0;  //density stratification g
B               B [ 0 0 0 0 0 0 0 ] 0.25; //turb modulation coeff
omegaBC         omegaBC [ 0 0 -1 0 0 0 0] 0.; // omegaWall inside the bed
kn              kn [ 0 0 1 0 0 0 0] 1.e-4; // wall roughness for the omegawallfunction

Cmu             Cmu [ 0 0 0 0 0 0 0 ] 0.09;
Tpsmall         Tpsmall [1 -3 -1 0 0 0 0] 1e-6;
kSmall          kSmall [0 2 -2 0 0 0 0] 1e-20;
nutMax          nutMax [0 2 -1 0 0 0 0] 1e-1;


// ************************************************************************* //
