sedfoam-master/tutorials/laminar/2DCollapse/loose/initial_1D_profile/1DSedim/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;



vertices        
(
    (0 0     0.05) //0
    (6 0     0.05) //1
    (6 5.4  0.05) //2
    (0 5.4  0.05) //3
    (0 0    -0.05) //4
    (6 0    -0.05) //5
    (6 5.4 -0.05) //6
    (0 5.4 -0.05) //7
);

blocks          
(
    hex (0 1 5 4 3 2 6 7) (1 1 250) simpleGrading (1 1 1)
);

edges           
(
);

boundary         
(
    inlet 
    {
     type   cyclic;
     neighbourPatch outlet;
     faces ((0 3 7 4));
    }
    outlet
    {
     type   cyclic;
     neighbourPatch  inlet;
     faces  ((1 5 6 2));
    }
    top
    { 
     type wall;
     faces ((7 6 2 3));
    }
    bottom 
    {
     type wall;
     faces ((0 4 5 1)); 
    }
    backPlane
    {
    type empty;
    faces ((0 1 2 3));
    }
    frontPlane
    {
    type empty;
    faces ((4 7 6 5));
    }
);


mergePatchPairs
(
);

// ************************************************************************* //
